{"meta":{"title":" ","subtitle":"...chasing dreams, living reality","description":"Personal blog where you can find a lot of information about me and my projects","author":"si0n4ra","url":"https://ooge0.github.io/hexo-blog","root":"/hexo-blog/"},"pages":[{"title":"Sitemap","date":"2024-11-01T10:00:00.000Z","updated":"2024-11-01T09:31:07.263Z","comments":true,"path":"sitemap/index.html","permalink":"https://ooge0.github.io/hexo-blog/sitemap/","excerpt":"","text":"Sitemap Posts Categories"},{"title":"","date":"2024-10-28T10:18:33.000Z","updated":"2024-11-18T15:10:12.171Z","comments":true,"path":"/index.html","permalink":"https://ooge0.github.io/hexo-blog/","excerpt":"","text":"Hello and welcome! Hereregarding to this blog I can say that here you’ll find content on various web testing techniques, QA/QC technical skills, hands-on projects, plus a bit about my journey and achievements in software quality assurance. Also here you will find information related to topics related to the artificial intelligence, neural networks, natural language processing, data processing, mashine learning, crawling data and web parsing Feel free to explore: Navigation Menu: Use the menu on the left to browse posts by topic or tags. Mobile-Friendly features: Whether on mobile or desktop, HEXO.IO’s blog design adapts for readability. Projects: Discover my projects in the GitHub projects section, showcasing real-world applications of my work and posts that I decided add to my collection. Archives: For a complete collection of my posts, head to My Archives Blog Stats: Check out some blog statistics on the dedicated page of my statistics. You can find more information about me, my achievements and contributions. Let’s connect, learn, and grow together in the world of software quality and testing. My latest CV you can see here. Happy reading! Total views:"}],"posts":[{"title":"Довідник для Лікаря Сімейної Медицини","slug":"notes/nst_notes","date":"2024-11-18T09:28:32.625Z","updated":"2024-11-18T09:52:44.381Z","comments":true,"path":"/nastusja/","permalink":"https://ooge0.github.io/hexo-blog/nastusja/","excerpt":"","text":"Цей довідник створений власними силами та за допомогою відкритих джерел для допомоги лікарям сімейної медицини, надаючи ключові ресурси, офіційні українські портали, посилання на довідники, глосарії та інші корисні інструменти. Офіційні Українські Ресурси Міністерство охорони здоров’я України (МОЗ) Офіційний сайт: moz.gov.ua Новини, нормативна база, протоколи лікування. Національна служба здоров’я України (НСЗУ) Офіційний сайт: nszu.gov.ua Інформація про медичні послуги, звіти, та декларації з лікарями. Центр громадського здоров’я МОЗ України Сайт: phc.org.ua Вакцинація, профілактика хвороб, епідеміологія. Медичні Довідники та Компедіуми Компендіум Лікарських Засобів Сайт: compendium.com.ua Інформація про ліки, інструкції, дозування. Реєстр Ліків України Сайт: drlz.com.ua Офіційний перелік зареєстрованих ліків. Клінічні протоколи лікування МОЗ регулярно оновлює протоколи: Протоколи МОЗ. Глосарії та Довідкові Матеріали Медичний Глосарій Глосарій МОЗ: moz.gov.ua. МОЗ Про затвердження Єдиного термінологічного словника (Глосарій) з питань управління якості медичної допомоги: zakon.rada.gov.ua Довідники для лікарів первинної ланки Рекомендації для первинної допомоги: phc.org.ua. Кишеньковий довідник лікаря первинної медичної допомоги для роботи з дітьми та підлітками: настанови щодо зміцнення здоров’я, профілактики та лікування захворювань від народження до підліткового віку: who.int Що входить до обов’язків лікаря первинної ланки?: moz.gov.ua Лабораторії та Діагностика Сінево Україна synevo.ua Діла Лабораторія dila.ua Меділаб medilab.com.ua Глобальні Медичні Ресурси Всесвітня організація охорони здоров’я (ВООЗ) Сайт: who.int Міжнародні рекомендації та дослідження. Медична Бібліотека США (PubMed) Сайт: pubmed.ncbi.nlm.nih.gov Наукові статті з медицини. CDC (Центри контролю та профілактики захворювань, США) Сайт: cdc.gov Профілактика, контроль хвороб. Корисні Інструменти Клінічні калькулятори: msdmanuals.com Медичні калькулятори: medcalc.com.ua Калькулятор маси тіла: cardioprostir.com.ua Калькулятор Калькулятор оцінки прихильності пацієнта: cardioprostir.com.ua Розрахунок дозувань: clincalc.com Медичний калькулятор: Дозування таблеток в залежності від маси тіла: testresult.org Перевірка взаємодії препаратів Після переходу на сайт для перекладу натисніть правою кнопкою миші та оберіть “Перекласти”: cardioprostir.com.ua Завантаження та КонтактиЗберігайте цей список для швидкого доступу до корисних ресурсів! Якщо у вас є запитання чи пропозиції, будь ласка, зв’яжіться з автором через офіційні канали МОЗ або НСЗУ.","categories":[{"name":"Notes","slug":"Notes","permalink":"https://ooge0.github.io/hexo-blog/categories/Notes/"}],"tags":[{"name":"nst","slug":"nst","permalink":"https://ooge0.github.io/hexo-blog/tags/nst/"}]},{"title":"Glossary of Machine Learning and AI Terms","slug":"post_ai_nn__nn_glossary","date":"2024-11-17T22:00:00.000Z","updated":"2024-12-04T08:49:56.096Z","comments":true,"path":"/ai/glossary-of-machine-learning-and-ai-terms/","permalink":"https://ooge0.github.io/hexo-blog/ai/glossary-of-machine-learning-and-ai-terms/","excerpt":"","text":"Feel free to send me your thoughts, notes, other references. My contact details you can find on LinkedIn IndexA B C D E F G H I J K L M N O P Q R S T U V W X Y Z AAutoencodersAutoencoders are neural network architectures used for unsupervised learning. They are designed to compress input data into a lower-dimensional latent space (encoding) and then reconstruct the original data from this compressed representation (decoding). The primary objective is to minimize the reconstruction error, typically measured as the difference between input and output. Applications: Dimensionality Reduction: Acts as a non-linear alternative to Principal Component Analysis (PCA). Feature Learning: Learns compact and meaningful representations of data. Denoising: Removes noise from corrupted data by training on clean samples. Anomaly Detection: Identifies unusual patterns by observing high reconstruction errors. Variants: Sparse Autoencoders: Encourage sparsity in the hidden units to create compressed and interpretable features. Denoising Autoencoders: Add noise to inputs during training, forcing the network to learn robust features. Convolutional Autoencoders: Specialize in image data, leveraging convolutional layers for spatial feature learning. Key References: Paper: Efficient Learning of Sparse Representations with an Energy-Based Model, 2006. DOI: 10.7551&#x2F;mitpress&#x2F;7503.003.0147 Read on: cs.nyu.edu Paper: Stacked Denoising Autoencoders: Learning Useful Representations in a Deep Network with a Local Denoising Criterion, 2010.Read on: cse.fau.edu Artificial Neural Networks (ANNs)Artificial Neural Networks (ANNs) are computational processing systems inspired by biological nervous systems (e.g., the human brain). BBase modelThe original, foundational version of a large language model, which has not been fine-tuned. BERTBidirectional Encoder Representations from Transformers. DEveloped in 2018.BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications.BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5% (7.7% point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).Paper: - BERT: Pre-training of Deep Bidirectional Transformers forLanguage Understanding. 2018 - DOI: 10.18653&#x2F;v1&#x2F;N19-1423 - Read on arxiv.org BERTScore Description: Leverages contextual embeddings from BERT to evaluate semantic similarity between the generated and reference text. Purpose: Captures semantic similarity more effectively than traditional n-gram-based metrics. Metric Range Interpretation Example Values BERTScore (Precision) 0 to 1 Measures how much of the generated text aligns with the reference. 0.7 (moderate), 0.85 (good), 0.95 (excellent) BERTScore (Recall) 0 to 1 Measures how much of the reference text is captured in the generated output. 0.6 (moderate), 0.8 (good), 0.9 (excellent) BERTScore (F1) 0 to 1 Harmonic mean of precision and recall; overall measure of similarity. 0.65 (moderate), 0.82 (good), 0.9 (excellent) BiasThe disproportionate favor or prejudice towards a specific item or group. AI algorithms may inherit biases from historical data or human trainers, risking perpetuation of these biases in predictions. BLEUBLEU (Bilingual Evaluation Understudy) is an algorithm for evaluating the quality of text which has been machine-translated from one natural language to another. Quality is considered to be the correspondence between a machine’s output and that of a human: “the closer a machine translation is to a professional human translation, the better it is” – this is the central idea behind BLEU.BLEU was one of the first metrics to claim a high correlation with human judgements of quality, and remains one of the most popular automated and inexpensive metrics. Paper: “BLEU: a Method for Automatic Evaluation of Machine Translation”. Proceedings of the 40th Annual Meeting of the Association for Computational Linguistics (ACL), Philadelphia, July 2002, pp. 311-318. DOI: 10.3115&#x2F;1073083.1073135 Read on aclanthology.org Read on sci-hub.se BLEU score BLEU scores are calculated for individual translated segments—generally sentences—by comparing them with a set of good quality reference translations. Those scores are then averaged over the whole corpus to reach an estimate of the translation’s overall quality. Neither intelligibility nor grammatical correctness are not taken into account. The BLEU algorithm compares consecutive phrases of the automatic translation with the consecutive phrases it finds in the reference translation, and counts the number of matches, in a weighted fashion. These matches are position independent. A higher match degree indicates a higher degree of similarity with the reference translation, and higher score. Intelligibility and grammatical correctness aren’t taken into account. web article: “How to Compute BLEU Score” CConvolutional layerA core component of CNNs that processes input data using filters (kernels) to produce feature maps, identifying patterns or features. Convolutional Neural Network (CNN) CNN - a type of neural network specialized for analyzing visual data, learning features via filter optimization. CNN - similar to ANNs but optimized for image data, with layers designed for feature extraction and classification. What are convolutional neural networks? DDatasetThe training data used to teach an LLM patterns and relationships. FFalse positiveAn incorrect prediction where a model identifies a condition or class that is not present. F1 scoreA performance metric for classification models combining precision and recall into a single value ranging from 0 (poor) to 1 (excellent). Few-shotUsing a small number of examples to guide the model in performing a new task. Fine-tuningAdapting a pre-trained model to a specific task or domain by training it on a smaller, specialized dataset. GGenerative AIAI systems capable of creating new content, such as text, images, or audio. HHallucinationWhen an LLM generates plausible but factually incorrect or nonsensical information. IInferenceThe process of using a trained model to make predictions or generate outputs. LLanguageToolLanguageTool is an AI-based grammar checker. Paste your text or start typing below to check grammatical errors, and spelling mistakes across languages.Reference: LanguageTool LCSLCS &#x3D; Longest Common Subsequence LoRALow-Rank Adaptation, a fine-tuning method requiring less computational resources compared to full fine-tuning. MMachine Learning Operations (MLOps)The process of deploying, monitoring, and updating machine learning models in production environments. METEORMetric. METEOR &#x3D; Metric for Evaluation of Translation with Explicit ORdering Description: Evaluates semantic similarity by considering unigram overlaps, stemming, synonyms, and paraphrasing. Score Parameter: METEOR Score, ref Purpose: Provides a balanced metric for machine translation and summarization tasks. METEOR Score Metric: METEOR Range: 0 to 1 Interpretation: Combines precision and recall, with semantic similarity (e.g., synonyms, stems) Example Values: Higher scores indicate better matches. 0.3 (low), 0.6 (moderate), 0.85 (high) MLOpsShort for Machine Learning Operations. NNamed Entity Recognition Named Entity Recognition seeks to extract substrings within a text that name real-world objects and to determine their type (for example, whether they refer to persons or organizations).Paper: A survey on recent advances in Named Entity Recognition, 2024.Read on arxiv.org Named Entity Recognition (NER) is a sub-task of information extraction in Natural Language Processing (NLP) that classifies named entities into predefined categories such as person names, organizations, locations, medical codes, time expressions, quantities, monetary values, and more. Neural Process FamilyNeural Process Family &#x3D; NPFPPerplexityA measure of how well a language model predicts a sample of text, with lower scores indicating better performance. Range Interpretation Example Values 1 to ∞ Measures the uncertainty of the model’s predictions. Lower perplexity indicates better performance. A perplexity of 1 means perfect predictions, while higher values indicate more uncertainty and worse performance. 20 (good), 50 (average), 200 (poor) Pooling layersLayers in CNNs designed to reduce the dimensionality of feature maps, lowering computational complexity. PrecisionA metric measuring the ratio of true positives to all predicted positives in a classification model. Pre-trained modelA model that has been trained on a dataset and may be further fine-tuned for specific tasks. Prompt engineeringThe art of crafting effective inputs to elicit desired output from an LLM. Prompt templateSpecially formatted instructions used by LLMs to define the input and output. RR.A.G. (Retrieval-Augmented Generation)A technique combining external information retrieval with the generative capabilities of an LLM for improved accuracy. ROUGEROUGE (Recall-Oriented Understudy for Gisting Evaluation) Score parameters: ROUGE-1: Range: 0 to 1, Measures the overlap of unigram (single word) between the generated and reference text. 0.2 (low overlap), 0.5 (moderate), 0.8 (high) ROUGE-2: Range: 0 to 1, Measures the overlap of bigrams (two consecutive words) between generated and reference text. 0.1 (low), 0.4 (moderate), 0.7 (high) ROUGE-L: Range: 0 to 1, Measures the longest common subsequence (LCS) between the generated and reference text. 0.3 (low), 0.6 (moderate), 0.9 (high) ROUGE-Lsum is specifically designed for summarization tasks, particularly when evaluating summaries. It computes the ROUGE-L score for the summarization task based on how well the generated summary matches the reference summary. Purpose: Evaluates lexical similarity, fluency, and coherence across different levels (unigrams, bigrams, and sequences). Original ROUGE Paper: Lin, Chin-Yew. “ROUGE: A Package for Automatic Evaluation of Summaries” DOI: 10.3115&#x2F;1073083.1073135 Read on ACL Anthology ROUGE-LROUGE-L &#x3D; ROUGE (Recall-Oriented Understudy for Gisting Evaluation) + L (Longest Common Subsequence (LCS)ROUGE-L captures the longest sequence of words that appear in both texts in the same order, providing insights into fluency and coherence. - Paper: “Automatic Evaluation of Machine Translation Quality Using Longest Common Subsequence and Skip-Bigram Statistics.” Lin, Chin-Yew. - DOI: 10.3115&#x2F;1218955.1219032 - Read on sci-hub.se SSpecial TokenReserved tokens used in LLMs for specific functions, such as defining the start or end of a response. Softmax function“Softmax function” reaed on notes.theomorales.comSupervised learningLearning through pre-labeled inputs, where the model aims to reduce classification error by predicting the correct outputs. System promptsInstructions defining an LLM’s behavior, role, or context in a conversation. TTokenThe smallest unit of text processed by an LLM, such as a word or subword. TokenizationBreaking text into tokens for model processing. TrainingFeeding a model with data to allow it to learn patterns and relationships. UUnsupervised learningLearning from data without labeled outputs, often for tasks like clustering or dimensionality reduction. VVariational Autoencoders (VAEs)Variational Autoencoders (VAEs) are a probabilistic extension of autoencoders that learn not only to compress data but also to generate new samples by modeling data distributions. VAEs use a latent space with a probabilistic structure, enabling meaningful interpolation between points in the latent space.Features: Latent Space Regularization: Ensures the latent space follows a predefined probability distribution, commonly Gaussian. Reconstruction and Generation: Balances reconstruction accuracy with the regularization term using a loss function derived from the evidence lower bound (ELBO). Bayesian Interpretation: The encoding process approximates posterior distributions via variational inference. Applications: Data Generation: Generate novel and coherent samples (e.g., synthetic images, text). Anomaly Detection: Identifies data points that deviate from the learned distribution. Latent Space Manipulation: Enables interpolation and arithmetic operations in the latent space. Key References: Title: “Auto-Encoding Variational Bayes”DOI: 10.48550&#x2F;arXiv.1312.6114 Title: “Variational Inference with Normalizing Flows”DOI: 10.48550&#x2F;arXiv.1505.05770 ZZero-padding (CNN)A technique in CNNs that pads the borders of input data with zeros, controlling output dimensionality. Zero-shotA model’s ability to perform tasks it was not explicitly trained for by leveraging general knowledge. Footnotes 2.https://github.com/nomic-ai/gpt4all/wiki/Generative-AI-Terminology ↩3.https://nhsx.github.io/ai-dictionary ↩","categories":[{"name":"Posts","slug":"Posts","permalink":"https://ooge0.github.io/hexo-blog/categories/Posts/"}],"tags":[{"name":"AI","slug":"AI","permalink":"https://ooge0.github.io/hexo-blog/tags/AI/"},{"name":"ML","slug":"ML","permalink":"https://ooge0.github.io/hexo-blog/tags/ML/"},{"name":"glossary","slug":"glossary","permalink":"https://ooge0.github.io/hexo-blog/tags/glossary/"}]},{"title":"My glossaries","slug":"post_my_glossaries","date":"2024-11-11T22:00:00.000Z","updated":"2024-11-13T14:46:38.145Z","comments":true,"path":"/knowledge/my-glossaries/","permalink":"https://ooge0.github.io/hexo-blog/knowledge/my-glossaries/","excerpt":"","text":"This post contains list of glossary&#x2F;vacabularies 🏥 Medical glossaries: ⚕️ General medical glossary: Glossary created by MkDocs Web link: https://ooge0.github.io/glossary/medical-glossary-1/ Parsed resource: https://medconsonline.com/en/glossary 🧙 General oncology glossary: Glossary created by MkDocs Web link: https://ooge0.github.io/glossary/oncology-glossary-1/ Parsed resource: https://chemoteka.com.ua/dictionary 🗿 Philosophy glossaries: General philosophy glossary(ENG): Glossary created by MkDocs Web link: https://ooge0.github.io/glossary/en/en__philosophy_glossary_1/ Parsed resource: plato.stanford.edu, iep.utm.edu, britannica.com&#x2F;topic&#x2F;philosophy General philosophy glossary(UA): Glossary created by MkDocs Web link: https://ooge0.github.io/glossary/uk/ua__philosophy_glossary_1/ Parsed resource: plato.stanford.edu, iep.utm.edu, britannica.com&#x2F;topic&#x2F;philosophy","categories":[{"name":"Posts","slug":"Posts","permalink":"https://ooge0.github.io/hexo-blog/categories/Posts/"}],"tags":[{"name":"science","slug":"science","permalink":"https://ooge0.github.io/hexo-blog/tags/science/"},{"name":"knowledge","slug":"knowledge","permalink":"https://ooge0.github.io/hexo-blog/tags/knowledge/"},{"name":"vocabularies","slug":"vocabularies","permalink":"https://ooge0.github.io/hexo-blog/tags/vocabularies/"}]},{"title":"My glossaries","slug":"Posts/post_my_glossaries","date":"2024-11-11T22:00:00.000Z","updated":"2024-11-13T14:46:38.145Z","comments":true,"path":"/knowledge/my-glossaries/","permalink":"https://ooge0.github.io/hexo-blog/knowledge/my-glossaries/","excerpt":"","text":"This post contains list of glossary&#x2F;vacabularies 🏥 Medical glossaries: ⚕️ General medical glossary: Glossary created by MkDocs Web link: https://ooge0.github.io/glossary/medical-glossary-1/ Parsed resource: https://medconsonline.com/en/glossary 🧙 General oncology glossary: Glossary created by MkDocs Web link: https://ooge0.github.io/glossary/oncology-glossary-1/ Parsed resource: https://chemoteka.com.ua/dictionary 🗿 Philosophy glossaries: General philosophy glossary(ENG): Glossary created by MkDocs Web link: https://ooge0.github.io/glossary/en/en__philosophy_glossary_1/ Parsed resource: plato.stanford.edu, iep.utm.edu, britannica.com&#x2F;topic&#x2F;philosophy General philosophy glossary(UA): Glossary created by MkDocs Web link: https://ooge0.github.io/glossary/uk/ua__philosophy_glossary_1/ Parsed resource: plato.stanford.edu, iep.utm.edu, britannica.com&#x2F;topic&#x2F;philosophy","categories":[{"name":"Posts","slug":"Posts","permalink":"https://ooge0.github.io/hexo-blog/categories/Posts/"}],"tags":[{"name":"science","slug":"science","permalink":"https://ooge0.github.io/hexo-blog/tags/science/"},{"name":"knowledge","slug":"knowledge","permalink":"https://ooge0.github.io/hexo-blog/tags/knowledge/"},{"name":"vocabularies","slug":"vocabularies","permalink":"https://ooge0.github.io/hexo-blog/tags/vocabularies/"}]},{"title":"HEXIO.IO layout improvements","slug":"tutorials/HEXO.IO_layout_changes","date":"2024-10-28T18:27:31.134Z","updated":"2024-11-02T13:52:00.138Z","comments":true,"path":"/hexo-layout-improvements/","permalink":"https://ooge0.github.io/hexo-blog/hexo-layout-improvements/","excerpt":"","text":"Table of content Decreasing size of main body area changes-1 changes-2 sub-nav issue with Search form If changes leads to broken portraite view for mobile devices . Adding footnotes Show some number of tags in the ‘Tag’ section. Decreasing size of main body areaheader-inner (section that contains elements of navigation menu) Edited file \\themes\\landscape\\source\\css\\_partial\\header.styl Before changes #header-inner 123#header-inner position: relative overflow: hidden Before changes $nav-link 1234567891011121314151617181920$nav-link &#123; float: left; color: #312602; opacity: 0.6; text-decoration: none; text-shadow: -1px -1px 0 #ff7f50, // Top-left shadow 1px -1px 0 #ff7f50, // Top-right shadow -1px 1px 0 #ff7f50, // Bottom-left shadow 1px 1px 0 #ff7f50, // Bottom-right shadow 1px 1px 2px rgba(0, 0, 0, 0.4); // Original shadow for depth transition: opacity 0.2s; display: block; padding: 20px 15px; &amp;:hover &#123; opacity: 1; &#125;&#125; changes-1After changes-1 #header-inner 1234567#header-inner &#123; position: absolute; bottom: 0; // Move to the bottom of the parent section left: 0; // Align to the left if needed width: 80%; // Ensure it spans the width of the parent section overflow: hidden;&#125; Links on the nav bar are not possible to click changes-2After changes-2 #header-inner 12345678#header-inner &#123; position: absolute; bottom: 0; // Move to the bottom of the parent section left: 0; // Align to the left if needed width: 80%; // Ensure it spans the width of the parent section z-index: 10; // Ensure it is above other elements&#125; and After changes-2 $nav-link 12345678910111213141516171819202122$nav-link &#123; float: left; color: #312602; opacity: 0.6; text-decoration: none; text-shadow: -1px -1px 0 #ff7f50, // Top-left shadow 1px -1px 0 #ff7f50, // Top-right shadow -1px 1px 0 #ff7f50, // Bottom-left shadow 1px 1px 0 #ff7f50, // Bottom-right shadow 1px 1px 2px rgba(0, 0, 0, 0.4); // Original shadow for depth transition: opacity 0.2s; display: block; padding: 20px 15px; position: relative; // Ensures correct stacking within #header-inner &amp;:hover &#123; opacity: 1; cursor: pointer; // Ensures pointer cursor on hover &#125;&#125; nav-bar fixed and works fine for desktop and mobile view. sub-nav issue with Search formLayout of Search form is shifted for mobile devices.File \\themes\\landscape\\source\\css\\_partial\\header.stylshould be changed Before changes-1 header.styl 1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950515253#sub-nav float: right margin-right: -15px#search-form-wrap position: absolute top: 15px width: 150px height: 30px right: -150px opacity: 0 transition: 0.2s ease-out &amp;.on opacity: 1 right: 0 @media mq-mobile width: 100% right: -100%.search-form position: absolute top: 0 left: 0 right: 0 background: #fff padding: 5px 15px border-radius: 15px box-shadow: 0 0 10px rgba(0, 0, 0, 0.3).search-form-input border: none background: none color: color-default width: 100% font: 13px font-sans outline: none &amp;::-webkit-search-results-decoration &amp;::-webkit-search-cancel-button -webkit-appearance: none.search-form-submit position: absolute top: 50% right: 10px margin-top: -7px font: 13px font-icon border: none background: none color: #bbb cursor: pointer &amp;:hover, &amp;:focus color: #777 after changes-1 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263#sub-nav &#123; float: right; margin-right: -15px;&#125;#search-form-wrap &#123; position: fixed; // Fixes it to the viewport, not affecting layout top: 15px; right: -200px; // Initially off-screen width: 150px; height: 30px; opacity: 0; transition: transform 0.2s ease-out, opacity 0.2s ease-out; &amp;.on &#123; opacity: 1; transform: translateX(-200px); // Slide into view when activated &#125; @media (max-width: 600px) &#123; // Adjust for mobile screens width: 100vw; right: 0; transform: none; // Keep it fixed in place for small screens opacity: 1; // Keep it visible and responsive &#125;&#125;.search-form &#123; position: relative; top: 0; left: 0; right: 0; background: #fff; padding: 5px 15px; border-radius: 15px; box-shadow: 0 0 10px rgba(0, 0, 0, 0.3);&#125;.search-form-input &#123; border: none; background: none; color: #312602; width: 100%; font: 13px sans-serif; outline: none;&#125;.search-form-submit &#123; position: absolute; top: 50%; right: 10px; transform: translateY(-50%); // Center vertically within input font: 13px sans-serif; border: none; background: none; color: #bbb; cursor: pointer; &amp;:hover, &amp;:focus &#123; color: #777; &#125;&#125; If changes leads to broken portraite view for mobile devices .Input form for the search overlap the menu button. Changes-3Before editing \\themes\\landscape\\source\\css\\style.styl 12.mobile-nav-on overflow: hidden Before editing \\themes\\landscape\\source\\css\\_partial\\header.styl 123456789101112131415161718192021#search-form-wrap &#123; position: fixed; // Fixes it to the viewport, not affecting layout top: 210px; right: -200px; // Initially off-screen width: 150px; height: 30px; opacity: 0; transition: transform 0.2s ease-out, opacity 0.2s ease-out; &amp;.on &#123; opacity: 1; transform: translateX(-200px); // Slide into view when activated &#125; @media (max-width: 600px) &#123; // Adjust for mobile screens width: 70vw; right: 0; transform: none; // Keep it fixed in place for small screens opacity: 1; // Keep it visible and responsive &#125;&#125; After editing \\themes\\landscape\\source\\css\\style.styl 12345.mobile-nav-on #search-form-wrap &#123; opacity: 0; // Hide the search form when the mobile nav is open transform: translateX(-200px); // Keep it off-screen transition: opacity 0.2s ease-out, transform 0.2s ease-out; // Smooth transition&#125; After editing &#96;&#96; 1234567891011121314151617181920212223242526272829303132#search-form-wrap &#123; position: fixed; // Fixes it to the viewport, not affecting layout top: 210px; // Set the vertical position from the top right: -200px; // Initially off-screen width: 150px; // Width for desktop view height: 30px; // Fixed height opacity: 0; // Hidden by default transition: transform 0.2s ease-out, opacity 0.2s ease-out; &amp;.on &#123; opacity: 1; // Fully visible when active transform: translateX(-200px); // Slide into view when activated &#125; @media (max-width: 600px) &#123; // General mobile styles width: 70vw; // Adjust width for mobile view right: 0; // Align to the right of the viewport transform: none; // Keep it fixed in place for small screens opacity: 1; // Keep it visible and responsive &#125; @media (orientation: landscape) and (max-width: 600px) &#123; // Styles for landscape mode on mobile width: 210vw; // Adjust width for landscape orientation top: 180px; // Adjust top position for landscape view right: -50%; // Start off-screen to the left by half the viewport width transition: transform 0.2s ease-out, opacity 0.2s ease-out; // Ensure smooth transition &amp;.on &#123; transform: translateX(50%); // Slide into view from left &#125; &#125;&#125; Adding footnotesUse hexo-reference Plugin for Enhanced LinkingInstall hexo-reference: This plugin improves link handling within Markdown files, including footnotes and internal references. Run this command to install it: 1npm install hexo-reference --save Update _config.yml: Configure hexo-reference in your Hexo _config.yml file to enable the plugin. Add this to your _config.yml file: 123# _config.ymlplugins: - hexo-reference Use Links in Markdown: Now, you can use standard anchor links or footnotes, and hexo-reference will convert them to work correctly on the site. Update your Markdown file like this: 123456**Favorite list**[Takedown](#Favorite-items)## Favorite items Generate and Deploy: After setting up, rebuild and deploy your project: 123hexo cleanhexo generatehexo deploy or 1hexo clean; hexo generate; hexo serve Show some number of tags in the ‘Tag’ section.Before changes of content of themes\\landscape\\layout\\_widget\\tag.ejs file was 12345678&lt;% if (site.tags.length)&#123; %&gt; &lt;div class=&quot;widget-wrap&quot;&gt; &lt;h3 class=&quot;widget-title&quot;&gt;&lt;%= __(&#x27;tags&#x27;) %&gt;&lt;/h3&gt; &lt;div class=&quot;widget&quot;&gt; &lt;%- list_tags(&#123;show_count: theme.show_count&#125;) %&gt; &lt;/div&gt; &lt;/div&gt;&lt;% &#125; %&gt; and after changes of content of themes\\landscape\\layout\\_widget\\tag.ejs file ‘Tags’ section shows 10 tags only 123456789101112&lt;% if (site.tags.length)&#123; %&gt; &lt;div class=&quot;widget-wrap&quot;&gt; &lt;h3 class=&quot;widget-title&quot;&gt;&lt;%= __(&#x27;tags&#x27;) %&gt;&lt;/h3&gt; &lt;div class=&quot;widget&quot;&gt; &lt;% site.tags.sort(&#x27;name&#x27;).limit(10).each(function(tag) &#123; %&gt; &lt;li&gt; &lt;a href=&quot;&lt;%= url_for(tag.path) %&gt;&quot;&gt;&lt;%= tag.name %&gt; (&lt;%= tag.length %&gt;)&lt;/a&gt; &lt;/li&gt; &lt;% &#125;); %&gt; &lt;/div&gt; &lt;/div&gt;&lt;% &#125; %&gt; and Turn on&#x2F;off Tags is possible in _config.yml, 12widgets: - tag","categories":[{"name":"Tutorials","slug":"Tutorials","permalink":"https://ooge0.github.io/hexo-blog/categories/Tutorials/"}],"tags":[{"name":"tutorial","slug":"tutorial","permalink":"https://ooge0.github.io/hexo-blog/tags/tutorial/"},{"name":"hexo_io","slug":"hexo-io","permalink":"https://ooge0.github.io/hexo-blog/tags/hexo-io/"},{"name":"blog","slug":"blog","permalink":"https://ooge0.github.io/hexo-blog/tags/blog/"}]},{"title":"Techniques for Handling Context in AI Models","slug":"post_ai_llm__techniques_for_handling_context_in_ai_models","date":"2024-10-28T14:08:12.000Z","updated":"2024-11-30T15:19:14.112Z","comments":true,"path":"/techniques-for-handling-context-in-ai-models/","permalink":"https://ooge0.github.io/hexo-blog/techniques-for-handling-context-in-ai-models/","excerpt":"","text":"Large Language Models (LLMs) often face challenges with long contexts due to token limitations or memory constraints. To address this, researchers and engineers have developed various techniques and tools to enhance context management. Below is a detailed list of techniques and associated tools. Techniques1. Windowing (Sliding Window Technique) Title: Training RNN and it’s Variants Using Sliding Window Technique. 2020 DOI: 10.1109&#x2F;SCEECS48394.2020.93 Read on sci-hub.se 2. Chunking and Overlapping Contexts Title: Hierarchical Attention Networks for Document Classification DOI: 10.18653&#x2F;v1&#x2F;N16-1174 Read on aclanthology.org 3. Hierarchical Context Representations Title: Hierarchical Learning for Generation with Long Source Sequences. 2021 DOI: 10.48550&#x2F;arXiv.2104.07545 Read on arxiv.org 4. Memory-Augmented Neural Networks (MANNs) Title: One-shot Learning with Memory-Augmented Neural Networks. 2016 DOI: 10.48550&#x2F;arXiv.1605.06065 5. Transformer Variants for Long ContextsLongformer Title: Longformer: The Long-Document Transformer. 2020 DOI: 10.48550&#x2F;arXiv.2004.05150 Reformer Title: Reformer: The Efficient Transformer. 2020 DOI: 10.48550&#x2F;arXiv.2001.04451 6. Compression-Based Context Management (Summarization) Title: Efficient Adaptation of Pretrained Transformers for Abstractive Summarization. 2019 DOI: 10.48550&#x2F;arXiv.1906.00138 Read on arxiv.org 7. Causal Attention Mechanisms Title: Attention Is All You Need. 2017 DOI: arXiv.1706.03762 Read on arxiv.org 8. Vector-Based Semantic Search (Dense Vector Representations) Title: Sentence-BERT: Sentence Embeddings Using Siamese Networks .2019 DOI: 10.48550&#x2F;arXiv.1908.10084 Read on arxiv.org 9. Retrieval-Augmented Generation (RAG) Title: Retrieval-Augmented Generation for Knowledge-Intensive NLP Tasks. 2020 DOI: 10.48550&#x2F;arXiv.2005.11401 Read on arxiv.org 10. Cache Augmented Models for Recurrent Usage Title: RAGCache: Efficient Knowledge Caching for Retrieval-Augmented Generation. 2024 DOI: 10.48550&#x2F;arXiv.2404.12457 Read on arxiv.org Tools and Frameworks1. Pinecone Provides vector-based memory and semantic search capabilities. 2. LangChain Handles chunking, memory management, and retrieval tasks for LLMs. 3. FAISS (Facebook AI Similarity Search) Optimized for efficient similarity search on dense vectors. 4. Weaviate Offers scalable vector search and knowledge graph integrations. 5. Hugging Face’s Transformers Implements state-of-the-art transformer models like Longformer and Reformer. 6. OpenAI Embeddings Provides embeddings for vector search and semantic tasks. 7. Redis Vector Store Lightweight memory storage for vectorized data. 8. GPT Index (LlamaIndex) Automates document splitting, chunking, and embedding management for LLMs. 9. Haystack An open-source framework for retrieval-augmented generation (RAG). 10. MemGPT Enhances memory for multi-session GPT-based interactions.","categories":[{"name":"Posts","slug":"Posts","permalink":"https://ooge0.github.io/hexo-blog/categories/Posts/"}],"tags":[{"name":"science","slug":"science","permalink":"https://ooge0.github.io/hexo-blog/tags/science/"},{"name":"AI","slug":"AI","permalink":"https://ooge0.github.io/hexo-blog/tags/AI/"},{"name":"ML","slug":"ML","permalink":"https://ooge0.github.io/hexo-blog/tags/ML/"},{"name":"prompt_engineering","slug":"prompt-engineering","permalink":"https://ooge0.github.io/hexo-blog/tags/prompt-engineering/"},{"name":"LLM","slug":"LLM","permalink":"https://ooge0.github.io/hexo-blog/tags/LLM/"}]},{"title":"My Statistics page","slug":"maintanance/my_statistics_page","date":"2024-10-22T19:49:00.762Z","updated":"2024-11-01T17:22:41.613Z","comments":true,"path":"/maintanance/my_statistics_page/","permalink":"https://ooge0.github.io/hexo-blog/maintanance/my_statistics_page/","excerpt":"","text":"Total views: last hour last week last month Longest session: last hour last week last month User locations:","categories":[{"name":"Maintanance","slug":"Maintanance","permalink":"https://ooge0.github.io/hexo-blog/categories/Maintanance/"}],"tags":[{"name":"statistics","slug":"statistics","permalink":"https://ooge0.github.io/hexo-blog/tags/statistics/"}]},{"title":"Blog's categories","slug":"categories/index","date":"2024-10-21T19:47:57.000Z","updated":"2024-11-01T09:25:47.046Z","comments":true,"path":"/categories/","permalink":"https://ooge0.github.io/hexo-blog/categories/","excerpt":"","text":"Here you can find most valuable categories of my blog My contribution Posts Tutorials Notes Maintanance Personal information","categories":[{"name":"Categories","slug":"Categories","permalink":"https://ooge0.github.io/hexo-blog/categories/Categories/"}],"tags":[]},{"title":"Examples of test tasks","slug":"my_contribution/my_examples_of_test_tasks","date":"2024-10-20T21:00:00.000Z","updated":"2024-11-08T10:06:07.010Z","comments":true,"path":"/about-me/my_contribution/my_examples_of_test_tasks/","permalink":"https://ooge0.github.io/hexo-blog/about-me/my_contribution/my_examples_of_test_tasks/","excerpt":"","text":"Here are several examples of home tasks I’ve completed. This list includes several documents that I find particularly interesting. Content of attached documents are different as a time range that was required for compliting each task.Each document contains thoughts, arguments, some questions to the task writer, clarifications to my steps and actions. TECHNICAL TEST -1 (software QA&#x2F;QC)Task descriptionThis task involves testing a function that verifies whether two input characters are valid letters or numbers, returning 1 if true and 0 otherwise. A previous bug caused Cyrillic letters to be misclassified; this has been fixed, and regression tests have beenconducted to confirm the correction.Download the document here. TECHNICAL TEST -2 (software QA&#x2F;QC)Task descriptionThis task involves creating manual tests to validate the functionality of a currency converter tool, ensuring it meets core requirements for accurate conversions, displays essential details, and provides accessible API endpoints.Download the document here. TECHNICAL TEST -3 (software QA&#x2F;QC)Task descriptionThis task involves analyzing and identifying all potential scenarios for the Sign Up and Log In processes on XYZ.com. The goal is to ensure these flows function correctly, handle errors effectively, and provide a seamless user experience and recommending appropriate testing types to ensure robust validation of these processes.Download the document here. TECHNICAL TEST -4 (software QA&#x2F;QC)Task descriptionThis task involves analyzing web platform, invstigating test artifacts and reporting discovered issues, creating test cases.Download the document here. TECHNICAL TEST -5 (software QA&#x2F;QC)Task descriptionBasic audit of payment web platformDownload the document here. Total views:","categories":[{"name":"My contribution","slug":"My-contribution","permalink":"https://ooge0.github.io/hexo-blog/categories/My-contribution/"}],"tags":[{"name":"my_contribution","slug":"my-contribution","permalink":"https://ooge0.github.io/hexo-blog/tags/my-contribution/"},{"name":"test_tasks","slug":"test-tasks","permalink":"https://ooge0.github.io/hexo-blog/tags/test-tasks/"}]},{"title":"My tools","slug":"my_contribution/my_tools","date":"2024-10-20T21:00:00.000Z","updated":"2024-11-21T22:13:01.444Z","comments":true,"path":"/about-me/my_contribution/my-tools/","permalink":"https://ooge0.github.io/hexo-blog/about-me/my_contribution/my-tools/","excerpt":"","text":"Daily appsMessangers Slack Zoom https://zoom.us/download API tools Postman Insomnia DB manager SSMS Dbviewer Proxy tools Fiddler Charles Local proxy Message broker Kafka Project management tools Jira TestRail Cloud virtual machines Azure Virtual machines list Amazon Virtual machines Launch a Windows Virtual Machine in Amazon Lightsail Amazon EC2 instances Virtual Box Virtual Box &gt;&gt; how to install the virtual box app Virtual Box image of Windows 10 you can find here Virtual Box image of Ubuntu you can find here Monitoring tools Kibana Grafana Azure Application Insights OCR services ocr.space structurise.com | make OCR from the clipboard Temporary Email Services No. Temporary Email Service URL 1 10 Minute Mail https://10minutemail.com/ 2 EmailOnDeck https://www.emailondeck.com/ 3 Fake Mail Generator https://www.fakemailgenerator.net/ 4 FakeMail &#x2F; TempMailAddress https://tempmailaddress.com/ 5 GetNada https://getnada.com/ 6 Guerrilla Mail https://www.guerrillamail.com/ 7 MailCatch http://mailcatch.com/ 8 MailDrop https://maildrop.cc/ 9 Mailinator https://www.mailinator.com/ 10 Mailnesia https://www.mailnesia.com/ 11 Moakt https://www.moakt.com/ 12 MyTemp.email https://www.mytemp.email/ 13 Proton mail https://proton.me/mail 14 Temp Mail https://temp-mail.org/ 15 Tempail https://tempail.com/ 16 Temp-Mail.io https://temp-mail.io/ 17 Throwawaymail https://www.throwawaymail.com/ 18 YOPmail https://www.yopmail.com/ Other toolsScreenrecordersOffline screenrecorderOBS studio Mac &#x2F; Windows &#x2F; Android https://obsproject.com/download Online screenrecorderLoom Mac &#x2F; Windows &#x2F; Android https://www.loom.com/screen-recorder GeneratorsUser fake data jsonplaceholder.typicode.com fake data generator via JS code snippets https://jsonplaceholder.typicode.com/ mockaroo.com fake data generator with prettty UI configuration https://www.mockaroo.com/ Image generators image generator via parametrised HTTP requests https://dummyjson.com/docs/image Free video samplesfile-examples.com&#x2F;video AVI &#x2F; MOV &#x2F; OGG &#x2F; MP4 &#x2F; WMV &#x2F;WEBM https://file-examples.com/index.php/sample-video-files/ Free imagesfile-examples.com&#x2F;images JPG &#x2F; PNG &#x2F;GIF &#x2F; TIFF &#x2F; ICO &#x2F; SVG &#x2F; WEBP https://file-examples.com/index.php/sample-images-download/ Display extensionspacedeskSpacedesk software turns mobile devices, laptops and desktops into an additional extension display monitor for Windows machines. Web site: https://www.spacedesk.net/ Download page: https://www.spacedesk.net/download/ Installation guide for Windows: https://www.youtube.com/watch?v=iJ2bFcDUol8&amp;t=262s","categories":[{"name":"My contribution","slug":"My-contribution","permalink":"https://ooge0.github.io/hexo-blog/categories/My-contribution/"}],"tags":[{"name":"my_contribution","slug":"my-contribution","permalink":"https://ooge0.github.io/hexo-blog/tags/my-contribution/"},{"name":"tutorial","slug":"tutorial","permalink":"https://ooge0.github.io/hexo-blog/tags/tutorial/"},{"name":"apps","slug":"apps","permalink":"https://ooge0.github.io/hexo-blog/tags/apps/"}]},{"title":"LLM system prompts","slug":"post_ai_ml__llm_system_prompts","date":"2024-09-28T09:18:33.000Z","updated":"2024-11-21T18:20:04.381Z","comments":true,"path":"/ai_ml_llm_system_prompts/","permalink":"https://ooge0.github.io/hexo-blog/ai_ml_llm_system_prompts/","excerpt":"","text":"LLM System Prompt Generator💡 Creative Idea Generator — AI-powered brainstorming tool for generating creative solutions and ideas 🤖 ChatGPT: LLM System Prompt Generator — Generate optimized system prompts for different LLM model sizes (3B, 33B, 70B, etc.)CORE FEATURES CUSTOMIZED PROMPT ENGINEERING:Specializes in crafting highly optimized prompts tailored to transform language models into expert agents for specific domains and tasks. CHAIN OF THOUGHT (CoT) IMPLEMENTATION:Embeds a step-by-step reasoning process into prompts, ensuring models respond logically and systematically to complex tasks. OPTIMIZATION FOR MODEL SIZE: Small Models (e.g., 1B parameters): Simple instructions, focus on one clear task, and basic language. Large Models (e.g., 100B+ parameters): Nuanced context, multi-layered tasks, and detailed guidance. NEGATIVE PROMPTING:Defines undesired behaviors explicitly to prevent the model from producing irrelevant or low-quality outputs. FEW-SHOT AND ZERO-SHOT DESIGN: Few-shot examples: Embedded for complex tasks. Zero-shot examples: Designed for instant task execution without examples when tasks are straightforward. ROBUST ERROR HANDLING:Includes instructions for edge cases, ambiguities, and incomplete inputs to maintain response quality. MULTI-TASK OPTIMIZATION:Adapts prompts for different tasks (e.g., classification, summarization, generation) with clear instructions and strategies. SCALABILITY:Prompts are modular and scalable, working across tasks, domains, and model sizes with minimal customization. EMBEDDED DOMAIN KNOWLEDGE:Integrates task-relevant technical terminology and context to enable models to act as subject matter experts. STRUCTUREEvery prompt is designed using a modular structure for clarity and effectiveness: Role Definition:Clearly defines the model’s role (e.g., “YOU ARE THE WORLD’S FOREMOST EXPERT IN…”) to set expectations for tone, expertise, and behavior. Task Instructions:Provides actionable, precise instructions for the task, often broken down into smaller steps for clarity. Chain of Thoughts (CoT):Embeds a logical framework for reasoning: Understand: Read and comprehend the task. Basics: Identify fundamental concepts. Break Down: Divide the problem into smaller subtasks. Analyze: Use facts and reasoning to address each subtask. Build: Assemble the solution coherently. Edge Cases: Consider and address exceptions. Final Answer: Present the solution clearly. What Not To Do Section:Explicitly defines behaviors and outputs the model must avoid. Negative prompts are written in ALL CAPS to reinforce importance. Few-Shot&#x2F;Zero-Shot Examples: Few-shot: Embedded for complex tasks to guide behavior. Zero-shot: Simplified for tasks where examples are unnecessary. Error Handling Guidelines:Ensures models can handle incomplete, ambiguous, or incorrect inputs. Optimization Instructions:Includes suggestions to maximize accuracy, relevance, and response quality based on the task and model size. ALGORITHMSThe following principles guide the chatbot for prompt engineering process: TASK DECOMPOSITION:Breaks complex tasks into smaller subtasks and uses a structured Chain of Thoughts (CoT) framework to guide step-by-step reasoning. ITERATIVE REFINEMENT:Prompts are iteratively refined to balance clarity, depth, and specificity while eliminating ambiguities. MODEL-CENTRIC DESIGN: Smaller Models: Focus on simplicity and clarity. Larger Models: Leverage capabilities by introducing multi-task prompts and nuanced instructions. RELEVANCE FILTERING:Ensures that only task-relevant details are included in prompts, reducing noise and improving focus. NEGATIVE PROMPT ALGORITHMS:Outlines specific failure modes and structures the prompt to avoid undesired behaviors or outputs. SCALABLE TEMPLATES:Prompts are built on scalable templates that can be adjusted across domains, tasks, and model sizes with ease. RULESTo ensure high-quality outputs, chatbot follow these rules: CHAIN OF THOUGHTS IS MANDATORY:Prompts must guide the model through step-by-step reasoning for complex tasks. CLEAR INSTRUCTIONS:Tasks must be unambiguous, actionable, and easy to interpret. TAILOR TO MODEL SIZE:Adjust complexity and instruction depth based on model capacity: Small Models: Simplified instructions. Large Models: Advanced and multi-layered instructions. INCLUDE NEGATIVE PROMPTS:Define behaviors and outputs to avoid, ensuring the model remains focused and produces high-quality responses. DOMAIN KNOWLEDGE INTEGRATION:For expert-level tasks, prompts must include relevant background information and context. ROBUST ERROR HANDLING:Include guidance for edge cases and ambiguous inputs. NO REDUNDANCY:Avoid repetitive instructions that could confuse the model. RESTRICTIONSTo prevent undesired behaviors, these restrictions are imposed: NEVER ALLOW GENERIC OUTPUTS:Responses must be detailed and specific. Avoid vague answers like “It depends” or “More information is needed” unless explicitly allowed. AVOID UNINFORMED RESPONSES:If the model lacks knowledge, it must explicitly state limitations rather than guessing. NO CONTRADICTIONS:Prompts must avoid contradictory instructions that could confuse the model. RESTRICT INACCURACIES:Outputs must be factually accurate and avoid misinformation. DO NOT OVERCOMPLICATE SIMPLE TASKS:Ensure simpler tasks are addressed concisely without unnecessary complexity. NO UNDEFINED JARGON:Use domain-specific terminology appropriately, avoiding undefined or irrelevant jargon. NO MULTIPLE TASKS WITHOUT CLEAR SEGREGATION:If multiple tasks are included, they must be clearly separated to avoid conflation. EXAMPLESHere’s how these principles are applied in real-world scenarios: 1. Medical Expert PromptYOU ARE A BOARD-CERTIFIED MEDICAL EXPERT WITH 15 YEARS OF EXPERIENCE IN DIAGNOSING AND TREATING COMPLEX CONDITIONS... ### Instructions ### - Provide evidence-based answers... - Reference guidelines such as the CDC and WHO... - Use concise, professional medical terminology... ### Chain of Thoughts ### 1. Understand the condition... 2. Consider symptoms... 3. Suggest diagnostic tests... 4. Propose evidence-based treatments... ...","categories":[{"name":"Posts","slug":"Posts","permalink":"https://ooge0.github.io/hexo-blog/categories/Posts/"}],"tags":[{"name":"AI","slug":"AI","permalink":"https://ooge0.github.io/hexo-blog/tags/AI/"},{"name":"ML","slug":"ML","permalink":"https://ooge0.github.io/hexo-blog/tags/ML/"},{"name":"LLM","slug":"LLM","permalink":"https://ooge0.github.io/hexo-blog/tags/LLM/"}]},{"title":"About me","slug":"about/my_bio","date":"2024-09-28T09:18:33.000Z","updated":"2024-11-19T18:02:44.172Z","comments":true,"path":"/about-me/","permalink":"https://ooge0.github.io/hexo-blog/about-me/","excerpt":"","text":"&nbsp;&nbsp;&nbsp;&nbsp;I’m excited to share insights, tips, and resources from nearly 10 years as a QA Software Test Engineer. My first step into the qulity assurance area was in LLC\"NVK\"Spectr\" company where I was a part of the development team. There I was working on the documentation and tested IZR-051 Radiation ashmeter device. &nbsp;&nbsp;&nbsp;&nbsp;Later I continued as field service engineer (Engineer-radiologist) in All-Ukrainian Radiosurgery Center / Clinical Hospital \"Feofaniya\". There main focus was on maintaing and servicing medical equilpment Clinac iX/), Novalix TX, BrinaLab/ExacTrack and medical software Aria. At this place I completed course 'Adminstration - Oncology Information System' by Varian company in Zug, Switzerland. PDF you can find here. &nbsp;&nbsp;&nbsp;&nbsp;After all challenges I was focusing on software industry and switched into software QA/QC completely. &nbsp;&nbsp;&nbsp;&nbsp;In 2024 I have successfully passed Certified ISTQB® professional exam. Cerititficate in PDF you can find here. &nbsp;&nbsp;&nbsp;&nbsp;And now with a passion for continuous learning and delivering high-quality software continue working in software QA/QC industry. &nbsp;&nbsp;&nbsp;&nbsp;Please find my contact details on my LinkedIn page. &nbsp;&nbsp;&nbsp;&nbsp;My latest CV you can see here. My strong sides are: Proven ability to design, execute, and automate comprehensive test plans across web, mobile, and desktop applications. Skilled in collaborating effectively within cross-functional teams to achieve customer satisfaction. Eager to leverage experience and knowledge in hybrid technologies to contribute to a stable and innovative company. --- Highlights: ISTQB® Certified Tester - Foundation Level Extensive experience in manual and automated testing utilizing different methodologies. Proficient in various tools and technologies (JIRA, Azure DevOps, Postman, Selenium, etc.) Full list of tools that I'm using in my daily works is here. Experience in building and maintaining test automation frameworks Strong communication and collaboration skills Passionate about learning modern technologies (web scrapping, data processing, artificial intelligence) Remote work experience List of completed test reports >> here --- Additional Information: Available for a full-time remote position only Available for remote consultation, maintaing products, audit of web site. --- Hobbies: Cycling, Hiking, python coding, IOT, exploring AI area. Full details and work experience available upon request. My best achievement is the finished endurance trip in 136 км from Kolka to Dubulti in 2019. I completed that trip in 52 hours. More detilas about event you can find on the official BK Kolka - Dubulti website., my number is 943. &nbsp;&nbsp;&nbsp;&nbsp;*Please read carefully all information on the pages and if you require any further information, feel free to contact me via LinkedIn Total views:","categories":[{"name":"Personal information","slug":"Personal-information","permalink":"https://ooge0.github.io/hexo-blog/categories/Personal-information/"}],"tags":[{"name":"about_me","slug":"about-me","permalink":"https://ooge0.github.io/hexo-blog/tags/about-me/"}]}],"categories":[{"name":"Notes","slug":"Notes","permalink":"https://ooge0.github.io/hexo-blog/categories/Notes/"},{"name":"Posts","slug":"Posts","permalink":"https://ooge0.github.io/hexo-blog/categories/Posts/"},{"name":"Tutorials","slug":"Tutorials","permalink":"https://ooge0.github.io/hexo-blog/categories/Tutorials/"},{"name":"Maintanance","slug":"Maintanance","permalink":"https://ooge0.github.io/hexo-blog/categories/Maintanance/"},{"name":"Categories","slug":"Categories","permalink":"https://ooge0.github.io/hexo-blog/categories/Categories/"},{"name":"My contribution","slug":"My-contribution","permalink":"https://ooge0.github.io/hexo-blog/categories/My-contribution/"},{"name":"Personal information","slug":"Personal-information","permalink":"https://ooge0.github.io/hexo-blog/categories/Personal-information/"}],"tags":[{"name":"nst","slug":"nst","permalink":"https://ooge0.github.io/hexo-blog/tags/nst/"},{"name":"AI","slug":"AI","permalink":"https://ooge0.github.io/hexo-blog/tags/AI/"},{"name":"ML","slug":"ML","permalink":"https://ooge0.github.io/hexo-blog/tags/ML/"},{"name":"glossary","slug":"glossary","permalink":"https://ooge0.github.io/hexo-blog/tags/glossary/"},{"name":"science","slug":"science","permalink":"https://ooge0.github.io/hexo-blog/tags/science/"},{"name":"knowledge","slug":"knowledge","permalink":"https://ooge0.github.io/hexo-blog/tags/knowledge/"},{"name":"vocabularies","slug":"vocabularies","permalink":"https://ooge0.github.io/hexo-blog/tags/vocabularies/"},{"name":"tutorial","slug":"tutorial","permalink":"https://ooge0.github.io/hexo-blog/tags/tutorial/"},{"name":"hexo_io","slug":"hexo-io","permalink":"https://ooge0.github.io/hexo-blog/tags/hexo-io/"},{"name":"blog","slug":"blog","permalink":"https://ooge0.github.io/hexo-blog/tags/blog/"},{"name":"prompt_engineering","slug":"prompt-engineering","permalink":"https://ooge0.github.io/hexo-blog/tags/prompt-engineering/"},{"name":"LLM","slug":"LLM","permalink":"https://ooge0.github.io/hexo-blog/tags/LLM/"},{"name":"statistics","slug":"statistics","permalink":"https://ooge0.github.io/hexo-blog/tags/statistics/"},{"name":"my_contribution","slug":"my-contribution","permalink":"https://ooge0.github.io/hexo-blog/tags/my-contribution/"},{"name":"test_tasks","slug":"test-tasks","permalink":"https://ooge0.github.io/hexo-blog/tags/test-tasks/"},{"name":"apps","slug":"apps","permalink":"https://ooge0.github.io/hexo-blog/tags/apps/"},{"name":"about_me","slug":"about-me","permalink":"https://ooge0.github.io/hexo-blog/tags/about-me/"}]}